package com.example.faq.data;

import static android.content.ContentValues.TAG;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.util.Log;


public class FAQ_Data {
    public FAQ_Data(SQLiteDatabase db) {
        // Gets the database in write mode


        // Create a ContentValues object where column names are the keys,
        // and Toto's Toosha attributes are the values.
        ContentValues first = new ContentValues();
        first.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_QUESTION, "What is your Name?");
        first.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_ANSWER, "MY NAME IS MOHAMMAD SAMEER");
        first.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_TITEL, "The Name");//1
        //
        ContentValues second = new ContentValues();
        second.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_QUESTION, "What is your Name2?");
        second.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_ANSWER, "MY NAME IS MOHAMMAD SAMEER");
        second.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_TITEL, "The Name");//1

        ContentValues thered = new ContentValues();
        thered.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_QUESTION, "What is your Name3?");
        thered.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_ANSWER, "MY NAME IS MOHAMMAD SAMEER");
        thered.put(FAQ_Contract.FAQEntry.COLUMN_FAQ_TITEL, "The Name");//1

        db.insert(FAQ_Contract.FAQEntry.FAQ_TABLE_NAME, null, first);
        db.insert(FAQ_Contract.FAQEntry.FAQ_TABLE_NAME, null, second);
        db.insert(FAQ_Contract.FAQEntry.FAQ_TABLE_NAME, null, thered);
        db.insert(FAQ_Contract.FAQEntry.FAQ_TABLE_NAME, null, thered);
        db.insert(FAQ_Contract.FAQEntry.FAQ_TABLE_NAME, null, thered);
        Log.d(TAG, "data inserted: ");
    }
}


//
//        ContentValues vaamal0 = new ContentValues();
//        vaamal0.put("amal_name", "fjr");//1
//
//        ContentValues vaamal1 = new ContentValues();
//        vaamal1.put("amal_name", "zohor");//2
//
//        ContentValues vaamal2 = new ContentValues();
//        vaamal2.put("amal_name", "asr");//3
//
//        ContentValues vaamal3 = new ContentValues();
//        vaamal3.put("amal_name", "maghrib");//4
//
//        ContentValues vaamal4 = new ContentValues();
//        vaamal4.put("amal_name", "isha");//5
//
//        ContentValues vaamal5 = new ContentValues();
//        vaamal5.put("amal_name", "tahajud");//6
//
//        ContentValues vaamal7 = new ContentValues();
//        vaamal7.put("amal_name", "charity");//7
//
//        ContentValues vaamal6 = new ContentValues();
//        vaamal6.put("amal_name", "study");//8
//
//        ContentValues vaamal8 = new ContentValues();
//        vaamal8.put("amal_name", "sport");//9
//
//
//        db.insert("amal", null, vaamal0);
//        db.insert("amal", null, vaamal1);
//        db.insert("amal", null, vaamal2);
//        db.insert("amal", null, vaamal3);
//        db.insert("amal", null, vaamal4);
//        db.insert("amal", null, vaamal5);
//        db.insert("amal", null, vaamal6);
//        db.insert("amal", null, vaamal7);
//        db.insert("amal", null, vaamal8);
//
//
//        // and Toto's tasbih_back attributes are the values.
//        ContentValues values = new ContentValues();
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_ARABIC, "لَا اِلَهَ اِلَّا الله ");
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_PASHTO, "ندی معبود برحق");
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_FARSI, "نیست معبود برحق بجز الله");
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_ENGLISH, "dear is no God but Allah");
//
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_FARSI, "این دعا را روزانه 4 مرتبه بخوانید خداوند از بلا زمین آسمان نگاه تان میکند");
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_COUNT, 15);
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_DEFAULT_COUNT, 15);
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_CATEGORY, FAQ_Contract.TASBIH_CATEGORY);
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_TOTAL_COUNT, 12);
//        values.put(FAQ_Contract.FAQEntry.COLUMN_TASBIH_STATE, 0);
//
//
//        // Create a ContentValues object where column names are the keys,
//        // and Toto's Toosha attributes are the values.
//        Calendar date = Calendar.getInstance();
//        date.set(Calendar.HOUR_OF_DAY, 0);
//        date.set(Calendar.MINUTE, 0);
//        date.set(Calendar.SECOND, 0);
//        date.set(Calendar.MILLISECOND, 0);
//
//
//        // Insert a new row for Toto in the database, returning the ID of that new row.
//        // The first argument for db.insertAmal() is the Toos table name.
//        // The second argument provides the name of a column in which the framework
//        // can insertAmal NULL in the event that the ContentValues is empty (if
//        // this is set to "null", then the framework will not insertAmal a row when
//        // there are no values).
//        // The third argument is the ContentValues object containing the info for Toto.
//
//
//        db.insert(FAQ_Contract.FAQEntry.TASBIH_TABLE_NAME, null, values);
//
//
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ", "", "", "", "این دعا را روزانه 4 مرتبه بخوانید خداوند از بلا زمین آسمان نگاه تان میکند", 3, MORNING_AZKAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)", "", "", "", "", 3, MORNING_AZKAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)", "", "", "", "", 3, MORNING_AZKAR);
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)", "", "", "", "", 3, MORNING_AZKAR);
////        insertAllData(db, "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.", "", "", "", "", 1, MORNING_AZKAR);
////        insertAllData(db, "من أذكار الصباح:\n" +
////                " اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.", "", "", "", "", 1, MORNING_AZKAR);
////        insertAllData(db, "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .", "", "", "", "", 1, MORNING_AZKAR);
////        insertAllData(db, "للّهُـمَّ إِنِّـي أَصْبَـحْتُ أَُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك .", "", "", "", "", 4, MORNING_AZKAR);
////        insertAllData(db, "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر .", "", "", "", "", 1, MORNING_AZKAR);
////        insertAllData(db, "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ .", "", "", "", "", 3, MORNING_AZKAR);
////        insertAllData(db, "اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ .\n", "", "", "", "", 3, MORNING_AZKAR);
////        insertAllData(db, " حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم . ( سبع مَرّات حينَ يصْبِح وَيمسي)\n", "", "", "", "", 7, MORNING_AZKAR);
////        insertAllData(db, "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي .\n", "", "", "", "", 1, MORNING_AZKAR);
////        insertAllData(db, "لحمد لله وحده ، والصلاة والسلام على من لا نبي بعده\n", "", "", "", "", 1, EVENING_AZKAR);
////        insertAllData(db, "للّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ\n", "", "", "", "", 1, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ (4)", "", "", "", "", 3, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "ُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)", "", "", "", "", 3, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, " قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)", "", "", "", "", 3, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, " أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.", "", "", "", "", 1, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "للهم بك أمسينا، وبك أصبحنا، وبك نحيا وبك نموت، وإليك المصير .\n", "", "", "", "", 1, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .", "", "", "", "", 1, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, " اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك", "", "", "", "", 1, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر", "", "", "", "", 1, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "للّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ", "", "", "", "", 3, FAQ_Contract.EVENING_AZKAR);
////        insertAllData(db, "َسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.", "", "", "", "", 3, FAQ_Contract.EVENING_AZKAR);
//////////////////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)", "", "", "", "", 3, DAY_NIGHT_AZkAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)", "", "", "", "", 3, DAY_NIGHT_AZkAR);
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)", "", "", "", "", 3, DAY_NIGHT_AZkAR);
////        insertAllData(db, "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.", "", "", "", "", 1, MORNING_AZKAR);
////        insertAllData(db, "من أذكار الصباح:\n" +
////                " اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.", "", "", "", "", 1, DAY_NIGHT_AZkAR);
////
////        ////////////////
////
////        insertAllData(db, "للهم بك أمسينا، وبك أصبحنا، وبك نحيا وبك نموت، وإليك المصير .\n", "", "", "", "", 1, FAQ_Contract.MOSQUE_AZKAR);
////        insertAllData(db, "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .", "", "", "", "", 1, FAQ_Contract.MOSQUE_AZKAR);
////        insertAllData(db, " اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك", "", "", "", "", 1, FAQ_Contract.MOSQUE_AZKAR);
////        insertAllData(db, "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر", "", "", "", "", 1, FAQ_Contract.MOSQUE_AZKAR);
////        insertAllData(db, "للّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ", "", "", "", "", 3, FAQ_Contract.MOSQUE_AZKAR);
////        insertAllData(db, "َسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.", "", "", "", "", 3, FAQ_Contract.MOSQUE_AZKAR);
////
////        ///////////////
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ", "", "", "", "", 3, PRAYER_AZKAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)", "", "", "", "", 3, PRAYER_AZKAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)", "", "", "", "", 3, PRAYER_AZKAR);
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)", "", "", "", "", 3, PRAYER_AZKAR);
////        insertAllData(db, "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.", "", "", "", "", 1, MORNING_AZKAR);
////
//////////////////////////\
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ", "", "", "", "", 3, SLEEP_AZKAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)", "", "", "", "", 3, SLEEP_AZKAR);
////
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)", "", "", "", "", 3, SLEEP_AZKAR);
////        insertAllData(db, "بسم الله الرحمن الرحيم \n" +
////                " \n" +
////                " قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)", "", "", "", "", 3, SLEEP_AZKAR);
////        insertAllData(db, "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.", "", "", "", "", 1, SLEEP_AZKAR);
////
////        insertAllData(db, "سبحان الله و بحمدی سبحان الله ", "", "", "", "", 33, FAQ_Contract.TASBIH_CATEGORY);
////        insertAllData(db, "الحمدلله ", "", "", "", "", 33, FAQ_Contract.TASBIH_CATEGORY);
////        insertAllData(db, "استغفر الله العظیم ", "", "", "", "", 33, FAQ_Contract.TASBIH_CATEGORY);
////        insertAllData(db, "لا حول ولا قوت الله بالله ", "", "", "", "", 33, FAQ_Contract.TASBIH_CATEGORY);
////
////
////    }
//
//}